# Pandas' DataFrame
Pandas is a python library that provides data structures for the programmer to perform data analysis.

In [360]:
import numpy as np
import pandas as pd

### 1) Defining a dataframe
The key function in pandas is DataFrame. It allows defining a dataframe object. A dataframe object is a **(2D, heterogenous, mutable) tabular data structure** whose rows and columns are labeled.

To define a dataframe we call function DataFrame as follows:

pd.DataFrame(data, index, columns, dtype, copy)

where
- data can be numpy array, a list, a dictionary or a DataFrame. We can (i) build a dataframe from another dataframe or (ii) use other data structures such as numpy arrays and lists.
- index is used to access dataframe rows.
- columns is used to access dataframe columns.
- dtype specifies the type of the data (if we want to force a homogenous dataframe).
- copy, when set to True, it makes a copy of the data.

Next, we make a dataframe from a numpy array. First, we define a 2D array of size 4x3.

In [362]:
array = np.random.randn(4, 3)

In [363]:
array

array([[-1.29793819,  1.72352923,  1.54330071],
       [ 0.2297917 , -0.20911437,  0.62631504],
       [ 1.40314928,  1.52680861,  0.40615058],
       [-0.35689016, -0.71079543,  1.90983918]])

To make a dataframe from array, we call function DataFrame with data=array. We also name the rows and columns.

In [364]:
arr_data = pd.DataFrame(array,
                       index = ['Row1','Row2','Row3','Row4'],
                       columns = ['Col1','Col2','Col3'])

In [365]:
arr_data

          Col1      Col2      Col3
Row1 -1.297938  1.723529  1.543301
Row2  0.229792 -0.209114  0.626315
Row3  1.403149  1.526809  0.406151
Row4 -0.356890 -0.710795  1.909839

We use "index" and "columns" to access to data.

In [366]:
col1 = arr_data["Col1"]

In [367]:
col1

Row1   -1.297938
Row2    0.229792
Row3    1.403149
Row4   -0.356890
Name: Col1, dtype: float64

We can access multiple columns.

In [368]:
arr_data[["Col1","Col3"]]

          Col1      Col3
Row1 -1.297938  1.543301
Row2  0.229792  0.626315
Row3  1.403149  0.406151
Row4 -0.356890  1.909839

In [369]:
type(arr_data)

pandas.core.frame.DataFrame

A DataFrame of dimension 1 is a Series.

In [370]:
type(col1)

pandas.core.series.Series

In [371]:
row2 = arr_data.loc["Row2"]

In [372]:
row2

Col1    0.229792
Col2   -0.209114
Col3    0.626315
Name: Row2, dtype: float64

In [373]:
type(row2)

pandas.core.series.Series

In [374]:
arr_data.loc[["Row2","Row3"]]

          Col1      Col2      Col3
Row2  0.229792 -0.209114  0.626315
Row3  1.403149  1.526809  0.406151

What if we do not specify "index" and "columns"?

In [375]:
array_test = np.random.randn(11, 5)

In [376]:
df = pd.DataFrame(array_test)

In [377]:
df

           0         1         2         3         4
0   0.176247 -2.366187 -1.661328 -0.919650  0.778643
1   0.464449 -0.633439  1.397082  1.133217 -0.696861
2  -0.695419 -0.226230 -1.985125 -0.143309  1.915521
3  -1.227636 -0.543208  0.757297  1.749714  0.275690
4  -0.629682 -0.984064  0.391784 -0.936299 -0.291280
5  -1.336826  0.807996  0.186094  1.318127  0.551252
6  -0.185977 -1.045222  0.487823  0.802348  0.623669
7  -2.280539 -1.382598 -0.226239 -0.707665  0.160197
8  -0.104400  1.799209 -1.762497 -0.494822 -0.184652
9  -0.582063 -0.004632 -0.571274  0.362729 -0.569015
10  1.306143  0.551700 -0.458635  1.431860 -2.072625

In [378]:
df[1]

0    -2.366187
1    -0.633439
2    -0.226230
3    -0.543208
4    -0.984064
5     0.807996
6    -1.045222
7    -1.382598
8     1.799209
9    -0.004632
10    0.551700
Name: 1, dtype: float64

In [379]:
df.loc[7]

0   -2.280539
1   -1.382598
2   -0.226239
3   -0.707665
4    0.160197
Name: 7, dtype: float64

We can make a dataframe from a list.

In [380]:
df_univ = pd.DataFrame([[1,"Ocha-dai",30],[2,"To-dai",40],[3,"Kyo-dai",60]],
                  index = ['Row1','Row2','Row3'],
                  columns = ['Col1','Col2','Col3'])

In [381]:
df_univ

      Col1      Col2  Col3
Row1     1  Ocha-dai    30
Row2     2    To-dai    40
Row3     3   Kyo-dai    60

In [382]:
df_univ['Col3']

Row1    30
Row2    40
Row3    60
Name: Col3, dtype: int64

In [383]:
type(df_univ['Col3'])

pandas.core.series.Series

To access rows, we use attribute 'loc'. We give the name or the index of the row to 'loc' as follows:

In [384]:
df_univ.loc['Row3']

Col1          3
Col2    Kyo-dai
Col3         60
Name: Row3, dtype: object

In [385]:
df

           0         1         2         3         4
0   0.176247 -2.366187 -1.661328 -0.919650  0.778643
1   0.464449 -0.633439  1.397082  1.133217 -0.696861
2  -0.695419 -0.226230 -1.985125 -0.143309  1.915521
3  -1.227636 -0.543208  0.757297  1.749714  0.275690
4  -0.629682 -0.984064  0.391784 -0.936299 -0.291280
5  -1.336826  0.807996  0.186094  1.318127  0.551252
6  -0.185977 -1.045222  0.487823  0.802348  0.623669
7  -2.280539 -1.382598 -0.226239 -0.707665  0.160197
8  -0.104400  1.799209 -1.762497 -0.494822 -0.184652
9  -0.582063 -0.004632 -0.571274  0.362729 -0.569015
10  1.306143  0.551700 -0.458635  1.431860 -2.072625

In [386]:
df.loc[3]

0   -1.227636
1   -0.543208
2    0.757297
3    1.749714
4    0.275690
Name: 3, dtype: float64

We can make a dataframe from a dictionary.

In [387]:
dic = {'Name':['Maria Callas','Freddie Mercury','Glenn Gould','Sergei Rachmaninoff'],
      'Birthdate':['02/12/1923','05/09/1946','25/09/1932','01/04/1873'],
      'Country':[['USA','Greece'],['UK'],['Canada'],['Russia']],
      'Music type':['Soprano','Rock','Soloist','Symphony'],
      'Album':[4,18,12,0]}

In [388]:
df_music = pd.DataFrame(dic)

In [389]:
df_music

                  Name   Birthdate        Country Music type  Album
0         Maria Callas  02/12/1923  [USA, Greece]    Soprano      4
1      Freddie Mercury  05/09/1946           [UK]       Rock     18
2          Glenn Gould  25/09/1932       [Canada]    Soloist     12
3  Sergei Rachmaninoff  01/04/1873       [Russia]   Symphony      0

In [390]:
df_music['Country']

0    [USA, Greece]
1             [UK]
2         [Canada]
3         [Russia]
Name: Country, dtype: object

In [391]:
df_music.loc[0]

Name           Maria Callas
Birthdate        02/12/1923
Country       [USA, Greece]
Music type          Soprano
Album                     4
Name: 0, dtype: object

We can perform slicing on dataframe using the attribute 'iloc'.  This is a slicing based on integer indexing, which is similar to the slicing on numpy array (see notebook on Numpy).

In [392]:
df_music

                  Name   Birthdate        Country Music type  Album
0         Maria Callas  02/12/1923  [USA, Greece]    Soprano      4
1      Freddie Mercury  05/09/1946           [UK]       Rock     18
2          Glenn Gould  25/09/1932       [Canada]    Soloist     12
3  Sergei Rachmaninoff  01/04/1873       [Russia]   Symphony      0

In [393]:
df_music.iloc[2:]

                  Name   Birthdate   Country Music type  Album
2          Glenn Gould  25/09/1932  [Canada]    Soloist     12
3  Sergei Rachmaninoff  01/04/1873  [Russia]   Symphony      0

In [394]:
col = df_music.iloc[2:,3]

In [395]:
col

2     Soloist
3    Symphony
Name: Music type, dtype: object

In [396]:
type(col)

pandas.core.series.Series

We can perform slicing on dataframe using the attribute 'loc'.  This is a slicing based on label indexing. Try the following example to understand how it works.

In [397]:
df_music

                  Name   Birthdate        Country Music type  Album
0         Maria Callas  02/12/1923  [USA, Greece]    Soprano      4
1      Freddie Mercury  05/09/1946           [UK]       Rock     18
2          Glenn Gould  25/09/1932       [Canada]    Soloist     12
3  Sergei Rachmaninoff  01/04/1873       [Russia]   Symphony      0

In [398]:
df_music.loc[1,'Country':]

Country       [UK]
Music type    Rock
Album           18
Name: 1, dtype: object

In [399]:
df_music.loc[:,'Name':'Country']

                  Name   Birthdate        Country
0         Maria Callas  02/12/1923  [USA, Greece]
1      Freddie Mercury  05/09/1946           [UK]
2          Glenn Gould  25/09/1932       [Canada]
3  Sergei Rachmaninoff  01/04/1873       [Russia]

In [400]:
df_music.loc[3]

Name          Sergei Rachmaninoff
Birthdate              01/04/1873
Country                  [Russia]
Music type               Symphony
Album                           0
Name: 3, dtype: object

In [401]:
df_music.loc[:,'Album'] > 5

0    False
1     True
2     True
3    False
Name: Album, dtype: bool

### 2) Some attributes
We have already seen attributes 'iloc' and 'loc' for data access and slicing. In the following, we list some useful attributes. For a complete list, please refer to pandas' official documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame

In [402]:
df_music

                  Name   Birthdate        Country Music type  Album
0         Maria Callas  02/12/1923  [USA, Greece]    Soprano      4
1      Freddie Mercury  05/09/1946           [UK]       Rock     18
2          Glenn Gould  25/09/1932       [Canada]    Soloist     12
3  Sergei Rachmaninoff  01/04/1873       [Russia]   Symphony      0

Attribute 'dtypes' lists the types of the data. Note that data in the same column have the same type.

In [403]:
df_music.dtypes

Name          object
Birthdate     object
Country       object
Music type    object
Album          int64
dtype: object

Attribute 'T' transpose the rows and columns.

In [404]:
df_music.T

                        0                1            2                    3
Name         Maria Callas  Freddie Mercury  Glenn Gould  Sergei Rachmaninoff
Birthdate      02/12/1923       05/09/1946   25/09/1932           01/04/1873
Country     [USA, Greece]             [UK]     [Canada]             [Russia]
Music type        Soprano             Rock      Soloist             Symphony
Album                   4               18           12                    0

In [405]:
df_music

                  Name   Birthdate        Country Music type  Album
0         Maria Callas  02/12/1923  [USA, Greece]    Soprano      4
1      Freddie Mercury  05/09/1946           [UK]       Rock     18
2          Glenn Gould  25/09/1932       [Canada]    Soloist     12
3  Sergei Rachmaninoff  01/04/1873       [Russia]   Symphony      0

Attribute 'shape' gives the dimention of the dataframe.

In [406]:
df_music.shape

(4, 5)

Attribute 'size' gives the number of elements in the dataframe.

In [407]:
df_music.size

20

To convert a dataframe to Numpy array, use attribute 'values'. In this case, all elements are forced to have the same type (recall that Numpy array is a homogenous data structure).

In [408]:
df

           0         1         2         3         4
0   0.176247 -2.366187 -1.661328 -0.919650  0.778643
1   0.464449 -0.633439  1.397082  1.133217 -0.696861
2  -0.695419 -0.226230 -1.985125 -0.143309  1.915521
3  -1.227636 -0.543208  0.757297  1.749714  0.275690
4  -0.629682 -0.984064  0.391784 -0.936299 -0.291280
5  -1.336826  0.807996  0.186094  1.318127  0.551252
6  -0.185977 -1.045222  0.487823  0.802348  0.623669
7  -2.280539 -1.382598 -0.226239 -0.707665  0.160197
8  -0.104400  1.799209 -1.762497 -0.494822 -0.184652
9  -0.582063 -0.004632 -0.571274  0.362729 -0.569015
10  1.306143  0.551700 -0.458635  1.431860 -2.072625

In [409]:
df.values

array([[ 0.17624655, -2.36618669, -1.6613278 , -0.91964968,  0.77864307],
       [ 0.46444891, -0.63343891,  1.39708221,  1.13321689, -0.69686104],
       [-0.69541867, -0.22623045, -1.98512526, -0.14330925,  1.91552056],
       [-1.22763628, -0.54320764,  0.75729681,  1.74971382,  0.27569009],
       [-0.62968223, -0.98406422,  0.39178394, -0.93629867, -0.29128006],
       [-1.33682612,  0.80799573,  0.18609417,  1.31812747,  0.55125245],
       [-0.18597749, -1.04522176,  0.48782312,  0.80234845,  0.62366888],
       [-2.28053876, -1.38259764, -0.22623853, -0.70766519,  0.16019655],
       [-0.10439981,  1.79920871, -1.7624967 , -0.49482174, -0.18465247],
       [-0.58206285, -0.00463219, -0.57127427,  0.36272854, -0.56901456],
       [ 1.30614339,  0.55170003, -0.4586354 ,  1.43186035, -2.07262468]])

In [411]:
np_music = df_music.values

Dataframe df_music have columns with mixed types (string, list, integers). In this case, all element are converted to a broader type called object.

In [412]:
np_music

array([['Maria Callas', '02/12/1923', list(['USA', 'Greece']), 'Soprano',
        4],
       ['Freddie Mercury', '05/09/1946', list(['UK']), 'Rock', 18],
       ['Glenn Gould', '25/09/1932', list(['Canada']), 'Soloist', 12],
       ['Sergei Rachmaninoff', '01/04/1873', list(['Russia']),
        'Symphony', 0]], dtype=object)

Also, we can use the column name as attribute!

In [413]:
df_music.Name

0           Maria Callas
1        Freddie Mercury
2            Glenn Gould
3    Sergei Rachmaninoff
Name: Name, dtype: object

In [414]:
df_music.Album

0     4
1    18
2    12
3     0
Name: Album, dtype: int64

The attributes 'columns' and 'index' gives the labels of dataframe columns and rows, respectively.

In [415]:
df_music.columns

Index(['Name', 'Birthdate', 'Country', 'Music type', 'Album'], dtype='object')

In [416]:
df_music.index

RangeIndex(start=0, stop=4, step=1)

### 3) Some methods
In the following, we list some useful methods (functions) to work with dataframe objects. For a complete list, please refer to pandas' official documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame

In [417]:
arr = np.random.randn(400, 10)

In [418]:
columns = ['A','B','C','D','E','F','G','H','I','J']

In [419]:
data = pd.DataFrame(arr, index = None, columns = columns)

#### 3.1) Basic statistics

When the data is too large, we use 'head()' to display a section of the dataframe, i.e. the 5 first rows. We use 'head(n)' to display the $n$ first rows.

In [420]:
data.head()

,A,B,C,D,E,F,G,H,I,J
0,-0.508419,-0.809501,0.464212,0.004010,-2.591329,-0.629943,-1.028110,0.071180,-0.352970,-0.166813
1,0.458703,-0.741903,-0.222123,-0.165650,0.812513,-0.607341,-1.434015,-0.339093,0.841057,-0.205175
2,-0.421503,0.802356,0.982811,-0.327560,-1.432869,-0.611179,-0.211967,-0.794308,-0.491659,-0.842206
3,0.653125,-0.156830,-2.315100,-0.465468,-0.274741,-1.484076,-0.756861,-0.566303,0.258462,1.110805
4,-1.375795,-0.518241,-2.202036,0.496923,-0.591149,-0.369657,-0.090341,-0.035255,0.758453,-1.157040

In [421]:
data.head(3)

,A,B,C,D,E,F,G,H,I,J
0,-0.508419,-0.809501,0.464212,0.00401,-2.591329,-0.629943,-1.028110,0.071180,-0.352970,-0.166813
1,0.458703,-0.741903,-0.222123,-0.16565,0.812513,-0.607341,-1.434015,-0.339093,0.841057,-0.205175
2,-0.421503,0.802356,0.982811,-0.32756,-1.432869,-0.611179,-0.211967,-0.794308,-0.491659,-0.842206

Same thing for method 'tail()'...

In [422]:
data.tail()

,A,B,C,D,E,F,G,H,I,J
395,-0.545222,0.079999,1.082402,0.780390,1.186726,1.341771,0.249340,-1.912650,2.153120,-0.554297
396,-0.120554,0.712456,1.086944,-0.921550,0.313897,-0.119294,-0.355124,2.171085,-0.693911,-1.144403
397,0.870202,-0.174426,0.501444,-1.148298,0.332812,0.894386,1.454256,0.643534,0.859927,-1.007962
398,1.192645,-0.479319,0.678675,-0.503124,1.859727,-1.235014,-0.889291,1.041647,0.485133,2.091500
399,-0.447056,0.904568,1.335487,-0.703162,-1.008153,1.898332,0.752677,-0.536101,-0.269068,0.928400

In [423]:
data.tail(10)

,A,B,C,D,E,F,G,H,I,J
390,-0.366924,0.002266,-1.663578,0.372017,-2.518245,-0.344957,1.353806,-1.005733,-0.622353,-1.201462
391,1.774875,-1.711905,-0.683024,0.372471,0.550015,0.043948,0.209415,1.078545,0.530641,-1.128720
392,-0.985998,1.443004,-1.695757,-0.123109,1.380132,-0.104154,0.906934,0.563014,-0.762480,-0.430563
393,0.538745,-0.185874,-0.132482,0.509295,0.138702,-1.681307,0.284003,-2.682490,-0.260139,-1.140059
394,-0.214971,-1.225135,0.829755,-0.835011,-0.176855,0.972798,-0.971317,1.114393,-0.632957,-0.696170
395,-0.545222,0.079999,1.082402,0.780390,1.186726,1.341771,0.249340,-1.912650,2.153120,-0.554297
396,-0.120554,0.712456,1.086944,-0.921550,0.313897,-0.119294,-0.355124,2.171085,-0.693911,-1.144403
397,0.870202,-0.174426,0.501444,-1.148298,0.332812,0.894386,1.454256,0.643534,0.859927,-1.007962
398,1.192645,-0.479319,0.678675,-0.503124,1.859727,-1.235014,-0.889291,1.041647,0.485133,2.091500
399,-0.447056,0.904568,1.335487,-0.703162,-1.008153,1.898332,0.752677,-0.536101,-0.269068,0.928400

We can perform basic statistics in one line! Method 'describe()' describes the data statistically. 
For each column, describe() computes the following.
- count gives the number of non-null data.
- mean gives the mean of the data.
- std is the standart deviation of the data.
- min is the minimum of the data.
- 25%, 50% and 70% are the lower percentile, median and upper percentile. 
- max is the maximum of the data.

In [424]:
data.describe()

,A,B,C,D,E,F,G,H,I,J
count,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000
mean,-0.121330,-0.018475,-0.009081,0.004598,-0.099179,-0.026629,-0.018709,0.038244,-0.040243,-0.064910
std,0.971693,0.955590,1.009573,0.973823,1.046432,1.010666,0.930187,1.031422,0.937244,1.066807
min,-2.566751,-2.550892,-3.095665,-3.129976,-3.489752,-2.625466,-3.549541,-3.003892,-3.649741,-3.588896
25%,-0.766417,-0.733184,-0.730950,-0.659846,-0.756127,-0.735528,-0.659703,-0.629434,-0.668255,-0.782369
50%,-0.192724,-0.007937,-0.038879,-0.033969,-0.092698,-0.078527,-0.034880,0.085210,-0.074580,-0.058233
75%,0.584195,0.589227,0.697198,0.624255,0.563173,0.699299,0.642224,0.726174,0.597022,0.663843
max,2.728574,3.030540,3.184723,2.883516,2.512933,2.571493,2.579600,2.480170,2.328013,3.027640

Methods for basic statistics can be called separately.

In [425]:
data.mean() # computes the mean for each column

A   -0.121330
B   -0.018475
C   -0.009081
D    0.004598
E   -0.099179
F   -0.026629
G   -0.018709
H    0.038244
I   -0.040243
J   -0.064910
dtype: float64

In [426]:
data.mean(axis = 1) # computes the mean for each row

0     -0.554768
1     -0.160303
2     -0.334808
3     -0.399699
4     -0.508414
5     -0.080444
6     -0.138164
7      0.074909
8      0.059072
9      0.241898
10     0.248219
11    -0.607447
12     0.323956
13    -0.481340
14    -0.246530
15    -0.124692
16    -0.193678
17     0.100801
18    -0.127969
19    -0.005769
20     0.004208
21     0.284564
22     0.241054
23    -0.033169
24     0.246474
25    -0.074642
26     0.034654
27    -0.458332
28     0.261124
29    -0.601261
         ...
370    0.074820
371    0.470905
372    0.355392
373   -0.439230
374   -0.087046
375   -0.234794
376   -0.009741
377   -0.310153
378   -0.543075
379   -0.212800
380    0.213641
381   -0.160446
382   -0.236634
383    0.267282
384   -0.102331
385   -0.211179
386   -0.129513
387   -0.282543
388   -0.254090
389   -0.008034
390   -0.599516
391    0.103626
392    0.019102
393   -0.461161
394   -0.183547
395    0.386158
396    0.092955
397    0.322588
398    0.424258
399    0.285592
Length: 400, dtype: float64

In [427]:
data.std() # computes the standard deviation for each column

A    0.971693
B    0.955590
C    1.009573
D    0.973823
E    1.046432
F    1.010666
G    0.930187
H    1.031422
I    0.937244
J    1.066807
dtype: float64

In [428]:
data.std(axis = 1) # computes the standard deviation for each row

0      0.841818
1      0.709502
2      0.732366
3      0.994547
4      0.887063
5      1.219905
6      0.658452
7      1.037633
8      0.999688
9      1.019902
10     0.726309
11     1.333081
12     1.045154
13     0.849915
14     1.093115
15     0.971225
16     0.996209
17     1.303833
18     0.694059
19     1.090249
20     1.041564
21     0.949863
22     1.179525
23     0.765529
24     1.263889
25     1.046386
26     1.367169
27     1.085438
28     0.929848
29     1.359729
         ...
370    1.156498
371    1.087139
372    1.126861
373    1.049771
374    1.080293
375    0.907907
376    1.355636
377    1.436741
378    0.825714
379    0.887740
380    1.243150
381    0.897164
382    0.760254
383    0.838091
384    0.801180
385    0.823370
386    1.140116
387    0.851395
388    1.194731
389    0.976941
390    1.084333
391    1.035257
392    1.041550
393    1.052240
394    0.859214
395    1.176876
396    1.011604
397    0.850636
398    1.156401
399    0.993799
Length: 400, dtype: float64

In [429]:
data.count() # counts the number of values for each column

A    400
B    400
C    400
D    400
E    400
F    400
G    400
H    400
I    400
J    400
dtype: int64

In [430]:
data.min() # returns the min of the values for each column

A   -2.566751
B   -2.550892
C   -3.095665
D   -3.129976
E   -3.489752
F   -2.625466
G   -3.549541
H   -3.003892
I   -3.649741
J   -3.588896
dtype: float64

In [431]:
data.min(axis = 1) # returns the min of the values for each row

0     -2.591329
1     -1.434015
2     -1.432869
3     -2.315100
4     -2.202036
5     -2.440685
6     -1.276702
7     -2.012623
8     -2.189840
9     -1.728786
10    -1.086235
11    -2.217277
12    -1.583116
13    -2.249558
14    -1.713860
15    -1.715253
16    -1.072133
17    -2.503812
18    -1.033359
19    -1.780962
20    -2.033258
21    -1.092403
22    -1.542041
23    -1.112869
24    -1.557083
25    -1.964034
26    -2.168816
27    -2.390900
28    -1.572286
29    -2.647917
         ...
370   -1.726938
371   -1.234087
372   -1.632888
373   -1.837312
374   -1.082555
375   -1.662666
376   -2.383428
377   -2.287651
378   -2.686242
379   -1.280891
380   -2.050132
381   -1.290126
382   -1.321531
383   -1.216372
384   -1.003964
385   -1.269212
386   -2.565448
387   -1.516716
388   -2.533409
389   -1.197145
390   -2.518245
391   -1.711905
392   -1.695757
393   -2.682490
394   -1.225135
395   -1.912650
396   -1.144403
397   -1.148298
398   -1.235014
399   -1.008153
Length: 400, dtype: float64

In [432]:
data.max() # returns the max of the values for each column

A    2.728574
B    3.030540
C    3.184723
D    2.883516
E    2.512933
F    2.571493
G    2.579600
H    2.480170
I    2.328013
J    3.027640
dtype: float64

In [433]:
data.max(axis = 1) # returns the max of the values for each row

0      0.464212
1      0.841057
2      0.982811
3      1.110805
4      0.758453
5      1.510999
6      0.908417
7      1.262275
8      1.782679
9      1.212018
10     1.265035
11     1.374051
12     1.498892
13     0.655012
14     1.572010
15     1.143668
16     1.686917
17     1.771615
18     1.200175
19     1.327367
20     1.693646
21     1.992398
22     1.811429
23     1.095318
24     2.894574
25     1.079818
26     2.244687
27     1.438292
28     1.652423
29     1.204911
         ...
370    1.749169
371    2.352166
372    1.662094
373    1.419854
374    1.600793
375    1.113881
376    1.577777
377    1.759849
378    0.089521
379    1.528787
380    1.711833
381    1.596605
382    1.418267
383    1.599127
384    1.269408
385    1.028472
386    1.587089
387    0.777224
388    1.497878
389    1.640054
390    1.353806
391    1.774875
392    1.443004
393    0.538745
394    1.114393
395    2.153120
396    2.171085
397    1.454256
398    2.091500
399    1.898332
Length: 400, dtype: float64

In [434]:
data.sum() # computes the sum of the values for each column

A   -48.531985
B    -7.390117
C    -3.632534
D     1.839343
E   -39.671720
F   -10.651610
G    -7.483601
H    15.297433
I   -16.097068
J   -25.963868
dtype: float64

In [435]:
data.sum(axis = 1) # computes the sum of the values for each row

0     -5.547682
1     -1.603026
2     -3.348083
3     -3.996986
4     -5.084136
5     -0.804442
6     -1.381642
7      0.749091
8      0.590720
9      2.418979
10     2.482195
11    -6.074469
12     3.239556
13    -4.813402
14    -2.465299
15    -1.246925
16    -1.936778
17     1.008012
18    -1.279687
19    -0.057687
20     0.042078
21     2.845640
22     2.410536
23    -0.331693
24     2.464742
25    -0.746415
26     0.346536
27    -4.583323
28     2.611238
29    -6.012608
         ...
370    0.748202
371    4.709049
372    3.553916
373   -4.392304
374   -0.870457
375   -2.347940
376   -0.097413
377   -3.101533
378   -5.430750
379   -2.127998
380    2.136407
381   -1.604456
382   -2.366341
383    2.672821
384   -1.023308
385   -2.111792
386   -1.295127
387   -2.825428
388   -2.540897
389   -0.080344
390   -5.995162
391    1.036262
392    0.191024
393   -4.611607
394   -1.835471
395    3.861577
396    0.929546
397    3.225875
398    4.242580
399    2.855925
Length: 400, dtype: float64

In [436]:
data.round() # rounds values

       A    B    C    D    E    F    G    H    I    J
0   -1.0 -1.0  0.0  0.0 -3.0 -1.0 -1.0  0.0 -0.0 -0.0
1    0.0 -1.0 -0.0 -0.0  1.0 -1.0 -1.0 -0.0  1.0 -0.0
2   -0.0  1.0  1.0 -0.0 -1.0 -1.0 -0.0 -1.0 -0.0 -1.0
3    1.0 -0.0 -2.0 -0.0 -0.0 -1.0 -1.0 -1.0  0.0  1.0
4   -1.0 -1.0 -2.0  0.0 -1.0 -0.0 -0.0 -0.0  1.0 -1.0
5   -0.0 -1.0 -1.0  1.0  2.0 -0.0 -0.0  1.0  1.0 -2.0
6   -1.0  0.0  1.0 -0.0 -0.0  0.0 -1.0 -0.0 -0.0  1.0
7    1.0 -0.0 -0.0  1.0 -1.0 -1.0  0.0 -2.0  1.0  1.0
8    0.0  2.0  0.0 -1.0  0.0  1.0  0.0  0.0  1.0 -2.0
9    1.0  0.0 -2.0  0.0  1.0  1.0  1.0  1.0 -2.0  0.0
10  -1.0 -0.0  1.0  1.0  1.0 -1.0  0.0  0.0  0.0  0.0
11  -2.0 -2.0  0.0  1.0 -2.0 -2.0  1.0 -1.0 -1.0  1.0
12  -1.0 -0.0  1.0 -2.0  1.0  0.0 -0.0  1.0  1.0  1.0
13   1.0 -0.0 -1.0 -1.0 -0.0 -2.0 -0.0  0.0 -1.0  0.0
14  -1.0  2.0 -1.0 -1.0 -0.0 -2.0  0.0  1.0 -1.0  1.0
15   1.0 -1.0 -1.0  0.0  0.0  0.0 -1.0  1.0 -0.0 -2.0
16  -0.0 -1.0 -1.0 -1.0  1.0  0.0 -1.0  2.0 -0.0 -1.0
17  -1.0  2.0 -1.0 -3.0  1.0  1.0  1.0 -0.0  1.0 -0.0
18   1.0 -1.0 -0.0 -1.0  0.0 -0.0 -0.0 -1.0 -0.0  1.0
19   1.0 -1.0  1.0  1.0 -2.0  1.0 -1.0  0.0 -0.0 -0.0
20   1.0 -2.0 -1.0  1.0 -0.0 -0.0  1.0 -0.0 -0.0  2.0
21  -1.0  1.0  2.0  1.0 -1.0  0.0  1.0 -0.0  1.0 -0.0
22   1.0  1.0  2.0 -1.0  0.0 -0.0 -0.0  2.0 -1.0 -2.0
23   0.0 -0.0  1.0  0.0 -1.0 -0.0  1.0 -1.0 -1.0  0.0
24  -2.0  1.0 -0.0  1.0 -0.0 -1.0 -0.0  0.0  1.0  3.0
25   1.0  0.0 -2.0  1.0 -1.0  1.0 -0.0  0.0 -1.0 -0.0
26   1.0  1.0  0.0 -1.0 -2.0  2.0  0.0  0.0  1.0 -2.0
27  -0.0 -1.0 -1.0 -0.0  0.0  1.0  1.0 -2.0 -1.0 -1.0
28  -2.0  1.0  0.0  1.0  0.0 -0.0  2.0 -1.0  0.0  1.0
29  -2.0  1.0 -1.0 -3.0 -1.0  1.0  0.0  1.0 -2.0 -1.0
..   ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
370  2.0  1.0  0.0  0.0 -1.0 -2.0 -1.0  1.0  0.0  0.0
371  1.0 -1.0  1.0  0.0 -0.0 -1.0  1.0  2.0  0.0  2.0
372 -1.0  2.0  2.0 -0.0 -2.0 -0.0 -0.0  2.0  1.0  1.0
373  0.0  1.0  1.0 -2.0 -1.0 -1.0 -2.0 -1.0 -0.0 -1.0
374 -0.0 -1.0 -1.0 -1.0  1.0  2.0 -1.0  1.0 -1.0 -0.0
375 -1.0 -1.0  0.0  1.0 -2.0 -1.0 -0.0 -1.0  1.0  0.0
376 -2.0 -0.0  1.0 -2.0  2.0  0.0 -1.0  0.0  0.0  1.0
377  1.0 -1.0 -2.0 -2.0  1.0  1.0  0.0  2.0 -2.0 -1.0
378  0.0  0.0 -0.0 -1.0 -3.0 -0.0 -0.0 -0.0 -1.0 -1.0
379 -1.0 -1.0 -1.0 -0.0 -1.0 -0.0 -1.0  2.0 -0.0  1.0
380  1.0 -1.0 -2.0  2.0  1.0 -1.0  1.0  1.0 -1.0  1.0
381 -1.0 -1.0  0.0  0.0 -1.0  2.0 -0.0 -1.0  1.0 -1.0
382 -0.0  1.0 -0.0 -1.0 -1.0 -1.0  0.0  0.0 -0.0 -0.0
383 -0.0  0.0  2.0  1.0 -1.0 -1.0  1.0  0.0  0.0  1.0
384 -1.0  1.0 -1.0 -0.0 -0.0 -0.0 -1.0  1.0 -1.0  1.0
385  1.0 -0.0 -1.0 -1.0  1.0 -1.0  1.0 -1.0  0.0 -1.0
386 -1.0 -1.0 -0.0 -0.0 -3.0  1.0  2.0  1.0 -0.0  0.0
387  1.0 -0.0 -1.0 -0.0 -1.0 -1.0  0.0 -2.0  1.0  1.0
388 -1.0  0.0  0.0 -3.0  1.0 -1.0  1.0  0.0 -1.0  0.0
389 -0.0  1.0  2.0 -1.0 -1.0 -1.0 -1.0  0.0 -0.0  1.0
390 -0.0  0.0 -2.0  0.0 -3.0 -0.0  1.0 -1.0 -1.0 -1.0
391  2.0 -2.0 -1.0  0.0  1.0  0.0  0.0  1.0  1.0 -1.0
392 -1.0  1.0 -2.0 -0.0  1.0 -0.0  1.0  1.0 -1.0 -0.0
393  1.0 -0.0 -0.0  1.0  0.0 -2.0  0.0 -3.0 -0.0 -1.0
394 -0.0 -1.0  1.0 -1.0 -0.0  1.0 -1.0  1.0 -1.0 -1.0
395 -1.0  0.0  1.0  1.0  1.0  1.0  0.0 -2.0  2.0 -1.0
396 -0.0  1.0  1.0 -1.0  0.0 -0.0 -0.0  2.0 -1.0 -1.0
397  1.0 -0.0  1.0 -1.0  0.0  1.0  1.0  1.0  1.0 -1.0
398  1.0 -0.0  1.0 -1.0  2.0 -1.0 -1.0  1.0  0.0  2.0
399 -0.0  1.0  1.0 -1.0 -1.0  2.0  1.0 -1.0 -0.0  1.0

[400 rows x 10 columns]

In [437]:
data.nunique() # counts the unique values for each column

A    400
B    400
C    400
D    400
E    400
F    400
G    400
H    400
I    400
J    400
dtype: int64

In [438]:
data.nunique(axis = 1) # counts the unique values for each row

0      10
1      10
2      10
3      10
4      10
5      10
6      10
7      10
8      10
9      10
10     10
11     10
12     10
13     10
14     10
15     10
16     10
17     10
18     10
19     10
20     10
21     10
22     10
23     10
24     10
25     10
26     10
27     10
28     10
29     10
       ..
370    10
371    10
372    10
373    10
374    10
375    10
376    10
377    10
378    10
379    10
380    10
381    10
382    10
383    10
384    10
385    10
386    10
387    10
388    10
389    10
390    10
391    10
392    10
393    10
394    10
395    10
396    10
397    10
398    10
399    10
Length: 400, dtype: int64

For object data (e.g. strings), describe() provides the following statistical description for each column.
- count is the number of data.
- unique is the number of unique data.
- top is the most common data.
- freq is the frequency of the most common data.

In [439]:
df_obj = pd.DataFrame({'Name':['A','D','S','K'],
                       'Nationality':['Japan','Colombia','Japan','Chile'],
                      'Gender':['F','F','M','F']})

In [440]:
df_obj.describe()

       Name Nationality Gender
count     4           4      4
unique    4           3      2
top       S       Japan      F
freq      1           2      3

#### 3.2) Modifying dataframe
Dataframe are mutable data structure. We can modify them or part of them.
When assigning a dataframe to another one, i.e. $\mathtt{df\_obj2} = \mathtt{df\_obj}$, both dataframes point to the same object in the memory.

In [441]:
id(df_obj) # dataframe id in the memory

4820901112

In [442]:
df_obj2 = df_obj

In [444]:
id(df_obj2)

4820901112

In [445]:
df_obj

  Name Nationality Gender
0    A       Japan      F
1    D    Colombia      F
2    S       Japan      M
3    K       Chile      F

We can modify a single value.

In [446]:
df_obj.iloc[3,1] = 'Palau'

In [447]:
df_obj

  Name Nationality Gender
0    A       Japan      F
1    D    Colombia      F
2    S       Japan      M
3    K       Palau      F

We can modify an entire column.

In [452]:
new_names = np.array(['Tsubaki','Rose','Yuri','Azalea'])
df_obj.Name = pd.Series(new_names, index = df_obj.index)

In [453]:
df_obj

      Name Nationality Gender
0  Tsubaki       Japan      F
1     Rose    Colombia      F
2     Yuri       Japan      M
3   Azalea       Palau      F

Adding new columns or new rows to a dataframe is tricky. First, recall that dataframe is 2D tabular structure. Each column is of type Series, which is a 1D tabular structure. 
To add new data --> we add a new column ---> we add a Series.

1. **Adding a new column**:
Let's add to $\mathtt{df\_obj}$ a new column that contains the age. The new column is a Series. Similarly to the way we defined dataframes in the previous section, we can make a Series from a Numpy array. The series must have one label to access its values because it is a 1D tabular structure. The label should be the same as the labels of rows of $\mathtt{df\_obj}$.

In [455]:
age_arr = np.array([20,23,22,21])
df_obj['Age'] = pd.Series(age_arr, index=df_obj.index)

In [456]:
df_obj

      Name Nationality Gender  Age
0  Tsubaki       Japan      F   20
1     Rose    Colombia      F   23
2     Yuri       Japan      M   22
3   Azalea       Palau      F   21

2. **Adding a new Row**: Let's add a new person to $\mathtt{df\_obj}$. We use the method $\mathtt{append()}$ to add a new row. The new row is a Series. In this case the indexes of the values are the names of the columns of $\mathtt{df\_obj}$. Note the parameter $\mathtt{ingnore\_index=True}$, it means that the index of the Series should be ignored and the index of the dataframe $\mathtt{df\_obj}$ should be used. Otherwise, pandas will complain.

In [459]:
new_person = np.array(['Jasmine','Angola','F',19])
df_obj.append(pd.Series(new_person,index=df_obj.columns),ignore_index=True)

      Name Nationality Gender Age
0  Tsubaki       Japan      F  20
1     Rose    Colombia      F  23
2     Yuri       Japan      M  22
3   Azalea       Palau      F  21
4  Jasmine      Angola      F  19

#### 3.3) Function application
This is a cool staff about pandas! Dataframe comes with useful methods to reason about the data. Let's add the grades to dataframe $\mathtt{df\_obj}$.

In [476]:
df_obj

      Name Nationality Gender  Age
0  Tsubaki       Japan      F   20
1     Rose    Colombia      F   23
2     Yuri       Japan      M   22
3   Azalea       Palau      F   21

In [477]:
grades = np.array([[8,6,10,5],[2,8,7,5],[5,10,10,2]])
df_obj['Math'] = pd.Series(grades[0], index=df_obj.index)
df_obj['Physics'] = pd.Series(grades[1], index=df_obj.index)
df_obj['CS'] = pd.Series(grades[2], index=df_obj.index)

In [478]:
df_obj

      Name Nationality Gender  Age  Math  Physics  CS
0  Tsubaki       Japan      F   20     8        2   5
1     Rose    Colombia      F   23     6        8  10
2     Yuri       Japan      M   22    10        7  10
3   Azalea       Palau      F   21     5        5   2

Question 1: How many students per country?

In [479]:
df_obj.groupby(['Nationality']).count()

             Name  Gender  Age  Math  Physics  CS
Nationality
Colombia        1       1    1     1        1   1
Japan           2       2    2     2        2   2
Palau           1       1    1     1        1   1

We can remove the unnecessary columns by indicating the label of the desired column.

In [480]:
df_obj.groupby('Nationality').count().Name

Nationality
Colombia    1
Japan       2
Palau       1
Name: Name, dtype: int64

Question 2: What is the average grade for Physics?

In [481]:
df_obj.Physics.mean()

5.5

Question 3: What is the sum of the grades in Math per nationality?

In [482]:
df_obj.groupby('Nationality').sum().Math

Nationality
Colombia     6
Japan       18
Palau        5
Name: Math, dtype: int64

Question 4: What is the mean of the scores per student?

In [487]:
df_obj

      Name Nationality Gender  Age  Math  Physics  CS
0  Tsubaki       Japan      F   20     8        2   5
1     Rose    Colombia      F   23     6        8  10
2     Yuri       Japan      M   22    10        7  10
3   Azalea       Palau      F   21     5        5   2

In [494]:
df_obj[['Name','Math','Physics','CS']].mean(axis=1)

0    5.0
1    8.0
2    9.0
3    4.0
dtype: float64

Question 5: What is the mean of math score per student?

In [503]:
new_person = np.array([['Jasmine','Angola','F',8,5,2,10],['Jasmine','Angola','F',8,10,6,10]])
df_obj = df_obj.append(pd.DataFrame(new_person,columns=df_obj.columns),ignore_index=True)

In [504]:
df_obj

      Name Nationality Gender Age Math Physics  CS
0  Tsubaki       Japan      F  20    8       2   5
1     Rose    Colombia      F  23    6       8  10
2     Yuri       Japan      M  22   10       7  10
3   Azalea       Palau      F  21    5       5   2
4  Jasmine      Angola      F   8    5       2  10
5  Jasmine      Angola      F   8   10       6  10

In [518]:
df = df_obj[['Name','Math','Physics','CS']].groupby('Name') ## Find a solution!!

#### 3.4) Missing data
When working in a ML project with real-world data, it may happen that some data is missing. There are couple of useful methods that allow us to tackle missing data. We demonstrate with dataframe data. First, we change some of the data, randomly, to None.

In [462]:
import random

In [464]:
data.head()

,A,B,C,D,E,F,G,H,I,J
0,-0.508419,-0.809501,0.464212,0.004010,-2.591329,-0.629943,-1.028110,0.071180,-0.352970,-0.166813
1,0.458703,-0.741903,-0.222123,-0.165650,0.812513,-0.607341,-1.434015,-0.339093,0.841057,-0.205175
2,-0.421503,0.802356,0.982811,-0.327560,-1.432869,-0.611179,-0.211967,-0.794308,-0.491659,-0.842206
3,0.653125,-0.156830,-2.315100,-0.465468,-0.274741,-1.484076,-0.756861,-0.566303,0.258462,1.110805
4,-1.375795,-0.518241,-2.202036,0.496923,-0.591149,-0.369657,-0.090341,-0.035255,0.758453,-1.157040

In [465]:
data.shape

(400, 10)

Let $\mathtt{random\_null(data, n)}$ be a function that replaces some $\mathtt{n}$ random values of a dataframe by np.nan (null value).

In [466]:
def random_null(data, n):
    pos = []
    nb_rows = data.shape[0]
    nb_columns = data.shape[1]
    for i in range(n):
        random_row = random.randint(0,nb_rows)
        random_col = random.randint(0,nb_columns)
        data.iloc[random_row,random_col] = np.nan

In [467]:
random_null(data,4) ## dataframe data will be modified.

We search for columns with missing values. Variable $\mathtt{col}$ iterates over the columns of the dataframe. For each column, i.e. given by $\mathtt{data[col]}$, we check whether some values/elements are null using the method $\mathtt{isnull()}$. It proceeds as follows. The values are given boolean values: $\mathtt{True}$ if it is $\mathtt{None}$, otherwise $\mathtt{False}$. Then, the method $\mathtt{any()}$ returns $\mathtt{True}$ if any value is $\mathtt{True}$, otherwise $\mathtt{False}$. Finally, a list of columns with missing values is returned.

In [468]:
def find_cols_with_missing_values(df):
    cols_with_missing = [col for col in df.columns
                         if df[col].isnull().any()]
    return cols_with_missing

In [469]:
find_cols_with_missing_values(data)

['B', 'E', 'G', 'H']

What should we do with the missing values? They may cause a problem in a machine learning project.

1. We could drop the columns where at least one value is missing. 
We use the method $\mathtt{drop(cols, axis)}$ where $\mathtt{cols}$ is a list of columns with missing values and $\mathtt{axis}$ indicates the axis for applying $\mathtt{drop}$, i.e. axis = 0 for rows and axis = 1 for columns.

In [470]:
data.drop(find_cols_with_missing_values(data),axis=1) # a new dataframe will be generated and dataframe data will not be modified.

            A         C         D         F         I         J
0   -0.508419  0.464212  0.004010 -0.629943 -0.352970 -0.166813
1    0.458703 -0.222123 -0.165650 -0.607341  0.841057 -0.205175
2   -0.421503  0.982811 -0.327560 -0.611179 -0.491659 -0.842206
3    0.653125 -2.315100 -0.465468 -1.484076  0.258462  1.110805
4   -1.375795 -2.202036  0.496923 -0.369657  0.758453 -1.157040
5   -0.199611 -0.762258  0.953903 -0.306445  1.088707 -2.440685
6   -1.276702  0.908417 -0.466564  0.023954 -0.107784  0.710629
7    0.590063 -0.088735  1.169984 -0.626284  1.197713  1.262275
8    0.280601  0.225175 -0.616618  0.530370  0.513155 -2.189840
9    0.877845 -1.728786  0.334548  0.840472 -1.505587  0.362630
10  -1.086235  0.903136  1.265035 -0.745759  0.328413  0.152595
11  -1.766774  0.448916  0.733600 -1.922342 -1.148442  0.736957
12  -0.857477  1.407313 -1.583116  0.347175  1.498892  0.658667
13   0.655012 -0.755260 -1.273429 -2.249558 -0.841035  0.410167
14  -0.673531 -1.292018 -1.145381 -1.713860 -0.866793  0.516982
15   1.128067 -1.140391  0.355362  0.294118 -0.106846 -1.715253
16  -0.080973 -1.045650 -1.010038  0.132656 -0.014318 -0.993139
17  -1.050676 -0.666600 -2.503812  1.208741  0.596591 -0.157408
18   1.200175 -0.196911 -0.659019 -0.423635 -0.482923  0.818109
19   1.222261  0.601841  1.139489  1.327367 -0.463260 -0.003746
20   0.717057 -0.846825  0.831337 -0.300017 -0.351669  1.693646
21  -0.860085  1.992398  1.125608  0.352089  0.529916 -0.489016
22   1.126195  1.811429 -0.530549 -0.206250 -1.388245 -1.542041
23   0.494729  1.095318  0.373843 -0.174998 -0.943910  0.221713
24  -1.557083 -0.346393  0.852429 -1.137781  0.972904  2.894574
25   0.851912 -1.964034  1.026519  1.079818 -0.910235 -0.011784
26   0.971019  0.033933 -0.776386  2.244687  0.939231 -2.019917
27  -0.202888 -1.399564 -0.054016  1.438292 -0.663759 -1.203014
28  -1.572286  0.088029  0.588155 -0.200403  0.025689  1.253129
29  -1.663192 -1.273141 -2.647917  1.204911 -2.072784 -0.859725
..        ...       ...       ...       ...       ...       ...
370  1.749169  0.402310  0.036701 -1.726938  0.418957  0.102460
371  0.675663  0.730917  0.485172 -0.748045  0.393629  2.352166
372 -0.697520  1.592317 -0.319711 -0.298511  1.013917  0.622195
373  0.246297  1.419854 -1.611641 -0.533710 -0.259570 -0.776554
374 -0.475400 -1.082555 -0.920087  1.600793 -0.965578 -0.157787
375 -0.820579  0.469094  1.113881 -0.697855  0.739672  0.455665
376 -2.383428  1.475883 -2.067411  0.310358  0.423309  1.151636
377  1.387492 -2.287651 -1.608878  0.555711 -2.000088 -1.289477
378  0.089521 -0.134548 -0.945269 -0.199210 -0.508308 -0.766631
379 -0.615527 -0.763761 -0.421910 -0.084411 -0.132103  1.123791
380  1.133519 -2.050132  1.711833 -0.639263 -0.904538  1.370332
381 -1.016160  0.419856  0.198014  1.596605  0.745386 -0.684989
382 -0.314889 -0.441852 -0.919534 -0.752842 -0.412547 -0.086416
383 -0.205314  1.599127  0.871297 -1.216372  0.409599  0.782358
384 -0.734394 -1.003964 -0.390457 -0.072642 -0.721363  1.269408
385  0.546518 -1.185915 -0.540120 -1.269212  0.107134 -0.589139
386 -0.949990 -0.033851 -0.477940  0.961714 -0.035673  0.224554
387  0.548764 -1.335625 -0.255994 -0.719582  0.777224  0.680220
388 -1.266451  0.465721 -2.533409 -0.990112 -1.161702  0.457793
389 -0.049883  1.640054 -0.802448 -0.931724 -0.201930  1.399231
390 -0.366924 -1.663578  0.372017 -0.344957 -0.622353 -1.201462
391  1.774875 -0.683024  0.372471  0.043948  0.530641 -1.128720
392 -0.985998 -1.695757 -0.123109 -0.104154 -0.762480 -0.430563
393  0.538745 -0.132482  0.509295 -1.681307 -0.260139 -1.140059
394 -0.214971  0.829755 -0.835011  0.972798 -0.632957 -0.696170
395 -0.545222  1.082402  0.780390  1.341771  2.153120 -0.554297
396 -0.120554  1.086944 -0.921550 -0.119294 -0.693911 -1.144403
397  0.870202  0.501444 -1.148298  0.894386  0.859927 -1.007962
398  1.192645  0.678675 -0.503124 -1.235014  0.485133  2.091500
399 -0.447056  1.335487 -0.703162  1.898332 -0.269068  0.928400

[400 rows x 6 columns]

In [471]:
data.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

2. We could replace the missing values with the mean of the values. 
We use the method $\mathtt{mean(axis, skipna)}$ to compute the mean of each column. When the parameter $\mathtt{skipna}$ is set to $\mathtt{True}$, the missing values are excluded from computing the result.

In [472]:
data.mean(axis = 0, skipna=True)

A   -0.121330
B   -0.016828
C   -0.009081
D    0.004598
E   -0.101692
F   -0.026629
G   -0.019227
H    0.036208
I   -0.040243
J   -0.064910
dtype: float64

In [473]:
find_cols_with_missing_values(data)

['B', 'E', 'G', 'H']

In [474]:
data = data.fillna(data.mean(axis = 0, skipna=True))

In [475]:
find_cols_with_missing_values(data)

[]

**Note** Methods $\mathtt{drop()}$, $\mathtt{mean()}$, $\mathtt{isnull}$ and $\mathtt{fillna}$ return **a new dataframe** and keep the original dataframe untouched.